БухЭксп/Catalogs/CW_ЛогистическиеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЛогистическиеСтатусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЦвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЛогистическиеСтатусы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьСоответствиеКартикиТипуЗначения() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			БиблиотекаКартинок.CW_Коробка);
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"), 			БиблиотекаКартинок.CW_Заявки);
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	БиблиотекаКартинок.CW_Грузоперевозки);
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеИмениМакетаТипуЗначения() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			"МакетОтбораДляЗаказа");
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"), 			"МакетОтбораДляЗаявки");
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	"МакетОтбораДляГрузоперевозки");
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеНеопредленногоСтатуса() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Заказы_СтатусНеопределен"));
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"), 			ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Заявки_СтатусНеопределен"));
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Грузоперевозки_СтатусНеопределен"));
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеИменКонстантМеханимаРасскраски() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			"CW_МеханизмРаскраскиЗаказов");
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"), 			"CW_МеханизмРаскраскиСпискаЗаявок");
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"),	"CW_МеханизмРаскраскиСписковМониторинга");
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМониторинговыеСтатусыОбъекта(ТипОбъекта, мИспользуемыеСтатусы) Экспорт
	
	ИдентифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.СсылкаКартинки КАК СсылкаКартинки,
	               |	CW_ЛогистическиеСтатусы.Наименование КАК Наименование,
	               |	CW_ЛогистическиеСтатусы.Ссылка В (&мИспользуемыеСтатусы) КАК Использование
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентифкаторОбъекта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ЛогистическиеСтатусы.Код
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ИдентифкаторОбъекта",  ИдентифкаторОбъекта);
	Запрос.УстановитьПараметр("мИспользуемыеСтатусы", мИспользуемыеСтатусы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции
	
	
	


//Служебные процедуры
Процедура ЗаполнитьПредпоределенныеОбъекты(ЛогистическийСтатусСсылка, ТипОбъекта) Экспорт
	
	Если ЛогистическийСтатусСсылка <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЛогистическийСтатусСсылка.ИдентификаторОбъекта) Тогда
			
			ИдентифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
			
			ЛогистическийСтатусОбъект 						= ЛогистическийСтатусСсылка.ПолучитьОбъект();
			ЛогистическийСтатусОбъект.ИдентификаторОбъекта 	= ИдентифкаторОбъекта;
			ЛогистическийСтатусОбъект.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Служебные процедуры

#КонецЕсли
